content-org/scripting.org
#+HUGO_BASE_DIR: ../
#+HUGO_WEIGHT: auto
#+HUGO_SECTION: scripting
#+HUGO_PAIRED_SHORTCODES: katex
#+OPTIONS: ^:{}
#+PROPERTY: header-args:jupyter-julia :session jl :exports both :eval no-export :async yes

* Scripting Tools
:PROPERTIES:
:EXPORT_FILE_NAME: scripting-tools
:END:
** Comments
You can prevent part of your code from being executed by putting it after a =#=. This is called a "comment".

#+begin_src julia :exports code
# this line is ignored
x = 1 # this text is ignored
#+end_src

You can comment multiple lines by starting them with =#== and ending them with ==#=.

#+begin_src julia :exports code
x = 1 # this line will run

#=
these lines will not run:
y = 2
z = 3
=#
#+end_src

Comments are also useful for annotating. When your code gets larger and more complicated, it becomes difficult to remember what it does and how it works. Adding comments helps you remember what your code does.

** Displaying Output
*** Terminal Output

When you run Julia in the terminal, results can be showed to the /standard output stream/. You can think of this stream as someone typing on a keyboard. You can instruct this figurative keyboard to type anything you want with Julia.

In the following sections, =‸= will represent the current position of the caret. For example, the result of typing "hello", the enter key, and "world" would look like:

#+begin_src text
hello
world‸
#+end_src

*** Printing

**** Print Line

The ~println~ (short for /print line/) function takes any amount of arguments, prints them one by one, then advances to the next output line (like pressing enter on the keyboard).

#+begin_src julia
println("hello")

x = 19
y = 5
println("The value of x is ", x)
println("x + y = ", x + y)
#+end_src

After the first ~println~ function runs, the terminal output will look like:

#+begin_src text
hello
‸
#+end_src

Notice the cursor is on the next line. After the next two print statements the total output will be:

#+begin_src text
hello123
The value of x is 19
x + y = 24
‸
#+end_src

**** Print

The ~print~ function does the same thing as ~println~ without advancing to the next output line. A simple example:

#+begin_src julia
print("hello ")
print("world")
#+end_src

After the first ~print~ runs, the output will look like:

#+begin_src text
hello ‸
#+end_src

After the next ~print~, the output will be

#+begin_src text
hello world‸
#+end_src

Notice that the cursor is still on the same line. If you try to print something else, it will all be on the same line:

#+begin_src julia
print("hello ")
print("world")
println("what's up")
#+end_src

#+begin_src text
hello worldwhat's up
‸
#+end_src

There are a couple ways to fix this issue. Firstly, you could call ~println()~. Since there are no arguments, it simply advances to the next line:

#+begin_src jupyter-julia
print("hello ")
print("world")
println()  # advances to next line of output
println("what's up")
#+end_src

#+begin_src text
hello world
what's up
‸
#+end_src

Many programming languages have special characters that mimic things like enter and tab on the keyboard. To mimic the enter key, type the two characters =\n= inside a string. The =n= stands for /new line/.

#+begin_src jupyter-julia
print("hello ")
print("world\n")  # add \n to mimic the enter key
println("what's up")
#+end_src

#+begin_src text
hello world
what's up
‸
#+end_src

